Tested it and got the following resuts:

```
# module.prefect.helm_release.prefect will be created
# module.prefect.helm_release.prefect will be created
   + resource "helm_release" "prefect" {
       + atomic                     = false
       + chart                      = "modules/kubernetes/services/prefect/chart"
       + cleanup_on_fail            = false
       + create_namespace           = false
       + dependency_update          = false
       + disable_crd_hooks          = false
       + disable_openapi_validation = false
       + disable_webhooks           = false
       + force_update               = false
       + id                         = (known after apply)
       + lint                       = false
       + manifest                   = (known after apply)
       + max_history                = 0
       + metadata                   = (known after apply)
       + name                       = "prefect"
       + namespace                  = "dev"
       + recreate_pods              = false
       + render_subchart_notes      = true
       + replace                    = false
       + reset_values               = false
       + reuse_values               = false
       + skip_crds                  = false
       + status                     = "deployed"
       + timeout                    = 300
       + values                     = [
           + <<-EOT
                 spec:
                   template:
                     spec:
                       containers:
                         - env:
                             - name: IMAGE_PULL_SECRETS
                               value: ''
                             - name: PREFECT__CLOUD__AGENT__LABELS
                               value: '[]'
                             - name: JOB_MEM_REQUEST
                               value: ''
                             - name: JOB_MEM_LIMIT
                               value: ''
                             - name: JOB_CPU_REQUEST
                               value: ''
                             - name: JOB_CPU_LIMIT
                               value: ''
                             - name: IMAGE_PULL_POLICY
                               value: ''
                             - name: PREFECT__BACKEND
                               value: cloud
                             - name: PREFECT__CLOUD__AGENT__AGENT_ADDRESS
                               value: http://:8080
             EOT,
           + "[{'PREFECT__CLOUD__AGENT__LABELS': ['dev', 'prod'], 'JOB_MEM_REQUEST': '20Gi'}]",
         ]
       + verify                     = false
       + version                    = "0.1.0"
       + wait                       = true
       + wait_for_jobs              = false
 
       + set {
           + name  = "cloudApi"
           + value = "https://api.prefect.io"
         }
       + set {
           + name  = "namespace"
           + value = "dev"
         }
       + set {
           + name  = "prefectImage"
           + value = "prefecthq/prefect:0.14.22-python3.8"
         }
 
       + set_sensitive {
           # At least one attribute in this block is (or was) sensitive,
           # so its contents will not be displayed.
         }
     }

```
Tying to solve the folowing error:
```
Error: ---> error unmarshaling JSON: while decoding JSON: json: cannot unmarshal array into Go value of type map[string]interface {} [{'PREFECT__CLOUD__AGENT__LABELS': ['dev', 'prod'], 'JOB_MEM_REQUEST': '20Gi'}]
 │ 
 │   with module.prefect.helm_release.prefect,
 │   on modules/kubernetes/services/prefect/main.tf line 1, in resource "helm_release" "prefect":
 │    1: resource "helm_release" "prefect" {
 │ 
```